Белгипрозем_2017/src/AccumulationRegisters/УчетДоговоров/УчетДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УчетДоговоров</name>
  <resources>
    <name>Сумма</name>
    <comment>Сумма с НДС</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЭтапДоговора</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.мСтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсвобождениеОтНДС</name>
    <type>
      <types>CatalogRef.мОсвобождениеОтНДС</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Белгипрозем_2017/src/AccumulationRegisters/РасчетыСПокупателями/РасчетыСПокупателями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСПокупателями</name>
  <resources>
    <name>Сумма</name>
    <comment>Сумма с НДС</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <comment>Дата расчетного документа</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидВзаимозачета</name>
    <type>
      <types>EnumRef.мВидыВзаимозачета</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПлатежа</name>
    <type>
      <types>CatalogRef.мСпособыПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСписанияЗадолженности</name>
    <type>
      <types>EnumRef.мВидыСписанияЗадолженности</types>
    </type>
  </attributes>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапДоговора</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Белгипрозем_2017/src/AccumulationRegisters/НачислениеЗП/НачислениеЗП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НачислениеЗП</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БазовоеНачисление</name>
    <comment>Сумма сделки без учета +/- коэф.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапДоговора</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРабот</name>
    <type>
      <types>CatalogRef.мОбъектыРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Белгипрозем_2017/src/AccumulationRegisters/ОстаткиПроизводство/ОстаткиПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПроизводство</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НоменклатураПроизводства</name>
    <type>
      <types>CatalogRef.мНоменклатураПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Калькуляция</name>
    <type>
      <types>DocumentRef.мКалькуляция</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Белгипрозем_2017/src/AccumulationRegisters/УчетПроизводство/УчетПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УчетПроизводство</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НоменклатураПроизводства</name>
    <type>
      <types>CatalogRef.мНоменклатураПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Калькуляция</name>
    <type>
      <types>DocumentRef.мКалькуляция</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапДоговора</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Белгипрозем_2017/src/AccumulationRegisters/Сметы/Сметы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Сметы</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРабот</name>
    <type>
      <types>CatalogRef.мОбъектыРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.мВидыРаботЮрЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смета</name>
    <type>
      <types>CatalogRef.мСметы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтадияРабот</name>
    <type>
      <types>CatalogRef.мСтадииРабот</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Белгипрозем_2017/src/CommonModules/ЗапасыСервер/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ДВИЖЕНИЙ

Процедура ОтразитьУчетДоговоров(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУчетДоговоров;
	
	Таблица.Свернуть("ВидДвижения, Договор, ЭтапДоговора, СтавкаНДС, ОсвобождениеОтНДС, Период, НомерДокумента", "Сумма, НДС");
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.УчетДоговоров.Записывать = Истина;
	Движения.УчетДоговоров.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьРасчетыСПокупателями(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица= ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыСПокупателями;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.РасчетыСПокупателями.Записывать = Истина;
	Движения.РасчетыСПокупателями.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьНачислениеЗП(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНачислениеЗП;
	
	// Удаление строк без Сумм
	й = Таблица.Количество()-1;
	Пока й >= 0 Цикл
		Если Таблица[й].Сумма = 0 и Таблица[й].БазовоеНачисление = 0 Тогда
			Таблица.Удалить(й);
		КонецЕсли; 	
	    й = й-1;
	КонецЦикла; 
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.НачислениеЗП.Записывать = Истина;
	Движения.НачислениеЗП.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьОстаткиПроизводства(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица= ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНоменклатураПроизводства;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.ОстаткиПроизводство.Записывать = Истина;
	Движения.ОстаткиПроизводство.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьУчетПроизводства(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица= ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНоменклатураПроизводства;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.УчетПроизводство.Записывать = Истина;
	Движения.УчетПроизводство.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОтразитьУчетСмет(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСмет;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.Сметы.Записывать = Истина;
	
	ВидДвижения = ВидДвиженияНакопления.Расход;
	
	Для Каждого Стр Из Таблица Цикл
		Если Не ЗначениеЗаполнено(Стр.ВидДвижения) Тогда
			ЭтоНачалоОбъекта = Истина;
			Продолжить;
		КонецЕсли; 
		Если ЭтоНачалоОбъекта Тогда
			// регистр Сметы Приход НДС по смете
			Движение = Движения.Сметы.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Стр);
			Движение.СтадияРабот = Неопределено;
			Движение.Сумма = 0;
		
			ЭтоНачалоОбъекта = Ложь;
		КонецЕсли; 
		
		Движение = Движения.Сметы.Добавить();
		Движение.ВидДвижения = ВидДвижения;
		ЗаполнитьЗначенияСвойств(Движение, Стр);
		Движение.НДС = 0;
	КонецЦикла;
КонецПроцедуры

Процедура ОтразитьИзменениеСведенийОСотрудниках(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.Таблица;
	//Таблица= ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСведенияОСотрудниках;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.мСведенияОСотрудниках.Записывать = Истина;
	Движения.мСведенияОСотрудниках.Загрузить(Таблица);
	
КонецПроцедуры

// ПРОЦЕДУРА вызывается мз внешней обработки УдалениеПроизошедшихБизнесСобытийМногопоточная
Процедура УдалитьПроизошедшиеБизнесСобытия(ТаблицаСобытия, ИндексНачала, РазмерПорции) Экспорт
    Для Сч = 1 По РазмерПорции Цикл
    
    	Индекс = ?(Сч=1, ИндексНачала, Индекс+1);
        Событие = ТаблицаСобытия[Индекс].Ссылка.ПолучитьОбъект();
        Событие.Удалить();
    КонецЦикла; 
КонецПроцедуры
